src/main/resources/xmls/salesforcequery/DataExtractionEAP.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"

 	xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">

<Header>
<SessionHeader xmlns="urn:partner.soap.sforce.com">
<sessionId></sessionId>
</SessionHeader>
</Header>
<Body>
<create xmlns="urn:partner.soap.sforce.com">
<sObjects>
 <type xmlns="urn:sobject.partner.soap.sforce.com">Data_Extraction_EAP__c</type>
                   <Object_Name__c xmlns=""></Object_Name__c>
                   <Object_Ref_ID__c xmlns=""></Object_Ref_ID__c>
              
                   
</sObjects>
</create>
</Body>
</Envelope>